Revit 2026 API

# ParameterIsReadOnly Property

---

Get the readonly property of the parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public override bool IsReadOnly { get; }
```
```vb
Public Overrides ReadOnly Property IsReadOnly As Boolean
	Get
```
```cpp
public:
virtual property bool IsReadOnly {
	bool get () override;
}
```
```fsharp
abstract IsReadOnly : bool with get
override IsReadOnly : bool with get
```

#### Property Value

Boolean

This function can be used to check if the parameter is read-only.

#### Reference

Parameter Class

Autodesk.Revit.DB Namespace